[GraphicalObject]
Name=nap
Path=diagtop
; RC-DLL=diaggui.dll
PosStyle=VARIABLE
WndStyle=
x= 0
y= 0
width=510
height= 220
Set0="BMP.dgnapmp|dgChangeDiagHelpIndex INSTPANEL| "
Rc-DLL=hpleo008.dll

[ToolDescriptor]
1=gototop   ,  PUSHBUTTON ,hpgbut02.dll
2=identify  ,  PUSHBUTTON ,hpgbut02.dll
3=logbook   ,  IMAGESET   ,hpgbut02.dll
4=temp      ,  IMAGESET   ,hpgbut02.dll
5=method    ,  IMAGESET   ,hpgbut02.dll
6=inValveL  ,  IMAGESET   ,hpgbut02.dll
7=inValveR  ,  IMAGESET   ,hpgbut02.dll
8=damper    ,  IMAGESET   ,hpgbut02.dll
9=PumpHeadL ,  IMAGESET   ,hpgbut02.dll
10=PumpHeadR,  IMAGESET   ,hpgbut02.dll
11=SSVL     ,  IMAGESET   ,hpgbut02.dll
12=SSVR     ,  IMAGESET   ,hpgbut02.dll
13=Loutvalve,  IMAGESET   ,hpgbut02.dll
14=Routvalve,  IMAGESET   ,hpgbut02.dll
15=turnonoff,  PUSHBUTTON ,hpgbut02.dll

[ColorAlias]
1=blue       |  0,  0, 255


[PUSHBUTTON gototop]
x=4
y=4
width=50
height=43
State=0
Enable=1
FrameThickness=1
SetIndex=0
ImageList=BMP...\..\LC\800\dggo2top|BMP...\..\LC\800\dggo2top|BMP...\..\LC\800\dggo2top
Command=dgGotoTopLevel nap
Help=機器パネルのトップレベルへの切替


[PUSHBUTTON identify]
x=445
y=182
width=58
height=25
State=0
Enable=1
FrameThickness=1
SetIndex=0
ImageList=Identify|Identify|Identify
Command=dgIdentifyModule "lpmp"
Help=ナノ ポンプ


[IMAGESET logbook]
x=455
y=14
width=40
height=40
State=0
Enable=1
FrameThickness=0
SetIndex=0
set0= BMP...\..\LC\800\dglogbk1|BMP...\..\LC\800\dglogbk1|BMP...\..\LC\800\dglogbk1|@view.floatingmenu "DiagGuiReg[4]", "naplogbook"|ナノ ポンプ ログブック
set1= BMP...\..\LC\800\dglogbk2|BMP...\..\LC\800\dglogbk2|BMP...\..\LC\800\dglogbk2|@view.floatingmenu "DiagGuiReg[4]", "naplogbook"|ナノ ポンプ ログブック
Cursor= CUR...\..\LC\800\HAND1
Help=""


[IMAGESET temp]
x=455
y=114
width=40
height=40
State=0
Enable=1
FrameThickness=0
SetIndex=0
set0= BMP...\..\LC\800\dgtemp01|BMP...\..\LC\800\dgtemp01|BMP...\..\LC\800\dgtemp01|@view.floatingmenu "DiagGuiReg[4]", "naptemp"|ナノ ポンプ温度
set1= BMP...\..\LC\800\dgtemp02|BMP...\..\LC\800\dgtemp02|BMP...\..\LC\800\dgtemp02|@view.floatingmenu "DiagGuiReg[4]", "naptemp"|ナノ ポンプ温度
Cursor= CUR...\..\LC\800\HAND1
Help=""

[IMAGESET method]
x=455
y=64
width=40
height=40
State=0
Enable=1
FrameThickness=0
SetIndex=0
set0= BMP...\..\LC\800\dgmethd1|BMP...\..\LC\800\dgmethd1|BMP...\..\LC\800\dgmethd1|@view.floatingmenu "DiagGuiReg[4]", "napmethod"|ナノ ポンプ メソッド
set1= BMP...\..\LC\800\dgmethd2|BMP...\..\LC\800\dgmethd2|BMP...\..\LC\800\dgmethd2|@view.floatingmenu "DiagGuiReg[4]", "napmethod"|ナノ ポンプ メソッド
Cursor= CUR...\..\LC\800\HAND1
Help=""

[IMAGESET inValveL]
x=53
y=66
width=32
height=47
State=0
Enable=1
FrameThickness=0
SetIndex=0
set0=   BMP.dginlet1|BMP.dginlet1|BMP.dginlet1|@view.floatingmenu "DiagGuiReg[4]", "napinValveL"|チャンネル A アクティブ インレット バルフ
set1=   BMP.dginlet2|BMP.dginlet2|BMP.dginlet2|@view.floatingmenu "DiagGuiReg[4]", "napinValveL"|チャンネル A アクティブ インレット バルフ
Cursor= CUR...\..\LC\800\HAND1
Help=""

[IMAGESET inValveR]
x=379
y=67
width=32
height=47
State=0
Enable=1
FrameThickness=0
SetIndex=0
set0=   BMP.dginlet1|BMP.dginlet1|BMP.dginlet1|@view.floatingmenu "DiagGuiReg[4]", "napinValveR"|チャンネル B アクティブ インレット バルブ
set1=   BMP.dginlet2|BMP.dginlet2|BMP.dginlet2|@view.floatingmenu "DiagGuiReg[4]", "napinValveR"|チャンネル B アクティブ インレット バルブ
Cursor= CUR...\..\LC\800\HAND1
Help=""

[IMAGESET damper]
x=194
y=44
width=66
height=43
State=0
FrameThickness=0
SetIndex=0
set0=   BMP.dgdampr1|BMP.dgdampr1|BMP.dgdampr1|@view.floatingmenu "DiagGuiReg[4]", "napdamper"|高圧ダンパ
set1=   BMP.dgdampr2|BMP.dgdampr2|BMP.dgdampr2|@view.floatingmenu "DiagGuiReg[4]", "napdamper"|高圧ダンパ
Cursor= CUR...\..\LC\800\HAND1
Help=""

[IMAGESET PumpHeadL]
x=85
y=50
width=68
height=62
State=0
FrameThickness=0
SetIndex=0
set0=   BMP.dglpmph1|BMP.dglpmph1|BMP.dglpmph1|@view.floatingmenu "DiagGuiReg[4]", "napPumpHeadL"|チャンネル A ポンプ ヘッド アセンブリ
set1=   BMP.dglpmph2|BMP.dglpmph2|BMP.dglpmph2|@view.floatingmenu "DiagGuiReg[4]", "napPumpHeadL"|チャンネル A ポンプ ヘッド アセンブリ
Cursor= CUR...\..\LC\800\HAND1
Help=""

[IMAGESET PumpHeadR]
x=311
y=51
width=68
height=62
State=0
FrameThickness=0
SetIndex=0
set0=   BMP.dgrpmph1|BMP.dgrpmph1|BMP.dgrpmph1|@view.floatingmenu "DiagGuiReg[4]", "napPumpHeadR"|チャンネル B ポンプ ヘッド アセンブリ
set1=   BMP.dgrpmph2|BMP.dgrpmph2|BMP.dgrpmph2|@view.floatingmenu "DiagGuiReg[4]", "napPumpHeadR"|チャンネル B ポンプ ヘッド アセンブリ
Cursor= CUR...\..\LC\800\HAND1
Help=""

[IMAGESET SSVL]
x=24
y=120
width=51
height=94
State=0
FrameThickness=0
SetIndex=0
set0=   BMP.dgssvl01|BMP.dgssvl01|BMP.dgssvl01|@view.floatingmenu "DiagGuiReg[4]", "napSSVL"|チャンネル A 溶媒切り替えバルブ
set1=   BMP.dgssvl02|BMP.dgssvl02|BMP.dgssvl02|@view.floatingmenu "DiagGuiReg[4]", "napSSVL"|チャンネル A 溶媒切り替えバルブ
set2=   BMP.dgnossvl|BMP.dgnossvl|BMP.dgnossvl||
Help=""

[IMAGESET SSVR]
x=388
y=121
width=52
height=93
State=0
FrameThickness=0
SetIndex=0
set0=   BMP.dgSSVR01|BMP.dgSSVR01|BMP.dgSSVR01|@view.floatingmenu "DiagGuiReg[4]", "napSSVR"|チャンネル B 溶媒切り替えバルブ
set1=   BMP.dgSSVR02|BMP.dgSSVR02|BMP.dgSSVR02|@view.floatingmenu "DiagGuiReg[4]", "napSSVR"|チャンネル B 溶媒切り替えバルブ
set2=   BMP.dgnoSSVR|BMP.dgnoSSVR|BMP.dgnoSSVR||
Help=""

[IMAGESET Loutvalve]
x=89
y=15
width=23
height=35
State=0
FrameThickness=0
SetIndex=0
set0=   BMP.dgoutva1|BMP.dgoutva1|BMP.dgoutva1|@view.floatingmenu "DiagGuiReg[4]", "napLoutvalve"|チャンネル A アウトレット ボール バルブ
set1=   BMP.dgoutva2|BMP.dgoutva2|BMP.dgoutva2|@view.floatingmenu "DiagGuiReg[4]", "napLoutvalve"|チャンネル A アウトレット ボール バルブ
Cursor= CUR...\..\LC\800\HAND1
Help=""

[IMAGESET Routvalve]
x=352
y=15
width=23
height=35
State=0
FrameThickness=0
SetIndex=0
set0=   BMP.dgoutva1|BMP.dgoutva1|BMP.dgoutva1|@view.floatingmenu "DiagGuiReg[4]", "napRoutvalve"|チャンネル B アウトレット ボール バルブ
set1=   BMP.dgoutva2|BMP.dgoutva2|BMP.dgoutva2|@view.floatingmenu "DiagGuiReg[4]", "napRoutvalve"|チャンネル B アウトレット ボール バルブ
Cursor= CUR...\..\LC\800\HAND1
Help=""

[PUSHBUTTON turnonoff]
x=425
y=10
width=15
height=15
State=0
Enable=1
FrameThickness=1
SetIndex=0
ImageList= RBMP.power|RBMP.power|RBMP.power_gray
Command=dgPumpTurnOnOrOff
Help=クリックでポンプ オンまたはオフ。
